
let nowQueue = [
    'Бірюков Денис',
    'Бойко Максим',
    'Бровчук Роман',
    'Верановський Ян',
    'Верба Соломія',
    'Гринчук Богдана',
    'Дмитрук Тарас',
    'Дорофєєв Назарій',
    'Дяков Дмитро',
    'Збирит Маргарита',
    'Коваль Марія',
    'Кривчук Андрій',
    'Крівцова Софія',
    'Кушнір Олексій',
    'Левчук Матвій',
    'Максимчук Марта',
    'Мартинюк Денис',
    'Мацевич Орест',
    'Мисюра Дмитро',
    'Михайлов Олександр',
    'Нечипорук Соломія',
    'Нікітський Роман',
    'Опанасюк Віктор',
    'Паламарчук Максим',
    'Пальчевська Софія',
    'Петрушина Софія',
    'Пилат Владислав',
    'Рищук Емілія',
    'Родзін Андрій',
    'Савчук Евеліна',
    'Сафонов Улас',
    'Слопачук Костянтин',
    'Статнік Микола',
    'Стихун Артем',
    'Трачук Матвій',
    'Українець Дмитро',
    'Шевчук Юстинія',
    'Шліхта Софія'
];
const today = new Date();
const dayOfWeek = today.getDate();

const now = document.querySelector('.now');
const date = document.querySelector('.date');

let nowIndex = 0;

function updateNow() {
    now.textContent = 'чергують зараз: ' + nowQueue[dayOfWeek % nowQueue.length] + ', ' + nowQueue[dayOfWeek + 1 % nowQueue.length];
}

function switchNow() {
    updateNow();
}

date.textContent = 'день місяця: ' + dayOfWeek;
switchNow();